; domain
(define (domain mobileworld_generic)
  ;; Generic MobileWorld domain (task-agnostic), improved:
  ;; 1) status complete must be the LAST action (finalization lock).
  ;; 2) input_text requires the text to be READY (supports causal chains from MCP outputs).
  ;; 3) typing allowed only when the focused field is visible on the current screen.
  ;; 4) focus is cleared on any screen transition; focus actions enforce single-focus.

  (:requirements
    :strips
    :typing
    :negative-preconditions
    :action-costs
    :equality
    :existential-preconditions
    :universal-preconditions
    :conditional-effects
  )

  (:types
    screen target field direction
    text
    goal_status
    tool param deliverable
  )

  (:constants
    home - screen
  )

  (:predicates
    ;; -----------------------
    ;; GUI / navigation state
    ;; -----------------------
    (at-screen ?s - screen)
    (focused ?f - field)

    (target-visible ?t - target ?s - screen)
    (field-visible  ?f - field  ?s - screen)

    (back-link ?from ?to - screen)

    ;; -----------------------
    ;; UI semantics hooks
    ;; -----------------------
    (click-transition ?t - target ?from ?to - screen)
    (doubletap-transition ?t - target ?from ?to - screen)
    (longpress-transition ?t - target ?from ?to - screen)

    (click-focus ?t - target ?s - screen ?f - field)
    (doubletap-focus ?t - target ?s - screen ?f - field)
    (longpress-focus ?t - target ?s - screen ?f - field)

    (drag-transition ?t1 ?t2 - target ?from ?to - screen)
    (scroll-transition ?d - direction ?from ?to - screen)
    (enter-transition ?from ?to - screen)

    ;; -----------------------
    ;; Text & task-control bookkeeping
    ;; -----------------------
    (text-entered ?txt - text)
    (field-has-text ?f - field ?txt - text)

    (answered ?txt - text)
    (asked-user ?txt - text)
    (status-set ?gs - goal_status)

    ;; NEW: text readiness gate (task-agnostic)
    (text-ready ?txt - text)

    ;; NEW: finalization lock (task-agnostic)
    (finalized)

    ;; -----------------------
    ;; MCP tool call modeling
    ;; -----------------------
    (tool-available ?tool - tool)
    (param-for-tool ?par - param ?tool - tool)
    (called ?par - param)

    (mcp-produces ?par - param ?d - deliverable)
    (have ?d - deliverable)
  )

  (:functions
    (total-cost) - number
  )

  ;; ============================================================
  ;; Helper effects used inline
  ;; ============================================================

  ;; ============================================================
  ;; GUI operations
  ;; ============================================================

  (:action click_navigate
    :parameters (?t - target ?from ?to - screen)
    :precondition (and
      (not (finalized))
      (at-screen ?from)
      (target-visible ?t ?from)
      (click-transition ?t ?from ?to)
    )
    :effect (and
      (not (at-screen ?from))
      (at-screen ?to)
      ;; clear focus when switching screens
      (forall (?f - field) (when (focused ?f) (not (focused ?f))))
      (increase (total-cost) 1)
    )
  )

  (:action click_focus_field
    :parameters (?t - target ?s - screen ?f - field)
    :precondition (and
      (not (finalized))
      (at-screen ?s)
      (target-visible ?t ?s)
      (field-visible ?f ?s)
      (click-focus ?t ?s ?f)
    )
    :effect (and
      ;; enforce single-focus
      (forall (?g - field) (when (focused ?g) (not (focused ?g))))
      (focused ?f)
      (increase (total-cost) 1)
    )
  )

  (:action double_tap_navigate
    :parameters (?t - target ?from ?to - screen)
    :precondition (and
      (not (finalized))
      (at-screen ?from)
      (target-visible ?t ?from)
      (doubletap-transition ?t ?from ?to)
    )
    :effect (and
      (not (at-screen ?from))
      (at-screen ?to)
      (forall (?f - field) (when (focused ?f) (not (focused ?f))))
      (increase (total-cost) 1)
    )
  )

  (:action double_tap_focus_field
    :parameters (?t - target ?s - screen ?f - field)
    :precondition (and
      (not (finalized))
      (at-screen ?s)
      (target-visible ?t ?s)
      (field-visible ?f ?s)
      (doubletap-focus ?t ?s ?f)
    )
    :effect (and
      (forall (?g - field) (when (focused ?g) (not (focused ?g))))
      (focused ?f)
      (increase (total-cost) 1)
    )
  )

  (:action long_press_navigate
    :parameters (?t - target ?from ?to - screen)
    :precondition (and
      (not (finalized))
      (at-screen ?from)
      (target-visible ?t ?from)
      (longpress-transition ?t ?from ?to)
    )
    :effect (and
      (not (at-screen ?from))
      (at-screen ?to)
      (forall (?f - field) (when (focused ?f) (not (focused ?f))))
      (increase (total-cost) 1)
    )
  )

  (:action long_press_focus_field
    :parameters (?t - target ?s - screen ?f - field)
    :precondition (and
      (not (finalized))
      (at-screen ?s)
      (target-visible ?t ?s)
      (field-visible ?f ?s)
      (longpress-focus ?t ?s ?f)
    )
    :effect (and
      (forall (?g - field) (when (focused ?g) (not (focused ?g))))
      (focused ?f)
      (increase (total-cost) 1)
    )
  )

  (:action drag_navigate
    :parameters (?t1 ?t2 - target ?from ?to - screen)
    :precondition (and
      (not (finalized))
      (at-screen ?from)
      (target-visible ?t1 ?from)
      (target-visible ?t2 ?from)
      (drag-transition ?t1 ?t2 ?from ?to)
    )
    :effect (and
      (not (at-screen ?from))
      (at-screen ?to)
      (forall (?f - field) (when (focused ?f) (not (focused ?f))))
      (increase (total-cost) 1)
    )
  )

  ;; IMPORTANT:
  ;; - must be focused
  ;; - must be on a screen where the field is visible
  ;; - text must be READY
  (:action input_text
    :parameters (?f - field ?txt - text)
    :precondition (and
      (not (finalized))
      (focused ?f)
      (text-ready ?txt)
      (exists (?s - screen)
        (and (at-screen ?s) (field-visible ?f ?s))
      )
    )
    :effect (and
      (text-entered ?txt)
      (field-has-text ?f ?txt)
      (increase (total-cost) 1)
    )
  )

  (:action scroll
    :parameters (?d - direction ?from ?to - screen)
    :precondition (and
      (not (finalized))
      (at-screen ?from)
      (scroll-transition ?d ?from ?to)
    )
    :effect (and
      (not (at-screen ?from))
      (at-screen ?to)
      (forall (?f - field) (when (focused ?f) (not (focused ?f))))
      (increase (total-cost) 1)
    )
  )

  ;; ============================================================
  ;; Navigation
  ;; ============================================================

  (:action navigate_home
    :parameters (?from - screen)
    :precondition (and
      (not (finalized))
      (at-screen ?from)
      (not (= ?from home))
    )
    :effect (and
      (not (at-screen ?from))
      (at-screen home)
      (forall (?f - field) (when (focused ?f) (not (focused ?f))))
      (increase (total-cost) 1)
    )
  )

  (:action navigate_back
    :parameters (?from ?to - screen)
    :precondition (and
      (not (finalized))
      (at-screen ?from)
      (back-link ?from ?to)
    )
    :effect (and
      (not (at-screen ?from))
      (at-screen ?to)
      (forall (?f - field) (when (focused ?f) (not (focused ?f))))
      (increase (total-cost) 1)
    )
  )

  (:action keyboard_enter
    :parameters (?from ?to - screen)
    :precondition (and
      (not (finalized))
      (at-screen ?from)
      (enter-transition ?from ?to)
    )
    :effect (and
      (not (at-screen ?from))
      (at-screen ?to)
      (forall (?f - field) (when (focused ?f) (not (focused ?f))))
      (increase (total-cost) 1)
    )
  )

  (:action wait
    :parameters ()
    :precondition (and
      (not (finalized))
    )
    :effect (and
      (increase (total-cost) 1)
    )
  )

  ;; ============================================================
  ;; Task control
  ;; ============================================================

  (:action answer
    :parameters (?txt - text)
    :precondition (and
      (not (finalized))
      (text-ready ?txt)   ;; optional but consistent: only answer ready text
    )
    :effect (and
      (answered ?txt)
      (increase (total-cost) 1)
    )
  )

  (:action ask_user
    :parameters (?txt - text)
    :precondition (and
      (not (finalized))
    )
    :effect (and
      (asked-user ?txt)
      (increase (total-cost) 1)
    )
  )

  ;; status is the TERMINAL action: once executed, the task is finalized.
  (:action status
    :parameters (?gs - goal_status)
    :precondition (and
      (not (finalized))
    )
    :effect (and
      (status-set ?gs)
      (finalized)
      (increase (total-cost) 1)
    )
  )

  ;; ============================================================
  ;; MCP call
  ;; ============================================================

  (:action mcp_call
    :parameters (?tool - tool ?par - param ?d - deliverable)
    :precondition (and
      (not (finalized))
      (tool-available ?tool)
      (param-for-tool ?par ?tool)
      (mcp-produces ?par ?d)
      (not (called ?par))
    )
    :effect (and
      (called ?par)
      (have ?d)
      (increase (total-cost) 1)
    )
  )

  ;; ============================================================
  ;; NEW: generic "materialize text from deliverable"
  ;; This is intentionally task-agnostic: any deliverable can be turned into any ready text.
  ;; The problem (or executor) decides what the deliverable contains and how the text is formed.
  ;; ============================================================
  (:action make_text_ready_from_deliverable
    :parameters (?d - deliverable ?txt - text)
    :precondition (and
      (not (finalized))
      (have ?d)
    )
    :effect (and
      (text-ready ?txt)
      (increase (total-cost) 1)
    )
  )
)

; problem
(define (problem mw_reply_daniel_most_recent_email_v1)
  (:domain mobileworld_generic)

  (:objects
    ;; ---------- screens ----------
    s_gmail_inbox
    s_email_daniel_most_recent
    s_reply_compose
    s_gmail_sent
    - screen

    ;; ---------- targets ----------
    t_gmail_icon
    t_daniel_most_recent_email
    t_reply_button
    t_body_field
    t_send_button
    - target

    ;; ---------- fields ----------
    f_body - field

    ;; ---------- directions ----------
    up down left right - direction

    ;; ---------- texts ----------
    txt_reply_to_daniel_10am_thu - text

    ;; ---------- goal status ----------
    complete infeasible - goal_status

    ;; ---------- tool/param/deliverable ----------
    ;; (not needed for this task)
  )

  (:init
    ;; ===== initial UI state =====
    (at-screen home)

    ;; ===== Text readiness =====
    ;; The reply sentence is a constant -> ready immediately.
    (text-ready txt_reply_to_daniel_10am_thu)

    ;; ===== UI visibility =====
    (target-visible t_gmail_icon home)

    ;; In inbox, the most recent email from Daniel is visible as a target
    (target-visible t_daniel_most_recent_email s_gmail_inbox)

    ;; In Daniel email detail screen, Reply button visible
    (target-visible t_reply_button s_email_daniel_most_recent)

    ;; In reply compose screen, body field + send visible
    (target-visible t_body_field s_reply_compose)
    (target-visible t_send_button s_reply_compose)

    (field-visible f_body s_reply_compose)

    ;; ===== UI transitions =====
    ;; Open Gmail
    (click-transition t_gmail_icon home s_gmail_inbox)

    ;; Open Daniel's most recent email
    (click-transition t_daniel_most_recent_email s_gmail_inbox s_email_daniel_most_recent)

    ;; Tap Reply -> goes to reply compose
    (click-transition t_reply_button s_email_daniel_most_recent s_reply_compose)

    ;; Send -> sent screen
    (click-transition t_send_button s_reply_compose s_gmail_sent)

    ;; Focus mapping
    (click-focus t_body_field s_reply_compose f_body)

    ;; Back links (optional)
    (back-link s_reply_compose s_email_daniel_most_recent)
    (back-link s_email_daniel_most_recent s_gmail_inbox)
    (back-link s_gmail_inbox home)

    ;; ===== cost init =====
    (= (total-cost) 0)
  )

  (:goal (and
    ;; Must have typed the reply content into body
    (field-has-text f_body txt_reply_to_daniel_10am_thu)

    ;; Must have sent the reply (reach sent screen)
    (at-screen s_gmail_sent)

    ;; Must finalize the task
    (status-set complete)
  ))

  (:metric minimize (total-cost))
)

; plan
1. (click_navigate t_gmail_icon home s_gmail_inbox)
   deleted: (at-screen home)
   added: (at-screen s_gmail_inbox)
   goals met: 0 of 3
2. (click_navigate t_daniel_most_recent_email s_gmail_inbox s_email_daniel_most_recent)
   deleted: (at-screen s_gmail_inbox)
   added: (at-screen s_email_daniel_most_recent)
   goals met: 0 of 3
3. (click_navigate t_reply_button s_email_daniel_most_recent s_reply_compose)
   deleted: (at-screen s_email_daniel_most_recent)
   added: (at-screen s_reply_compose)
   goals met: 0 of 3
4. (click_focus_field t_body_field s_reply_compose f_body)
   added: (focused f_body)
   goals met: 0 of 3
5. (input_text f_body txt_reply_to_daniel_10am_thu)
   added: (text-entered txt_reply_to_daniel_10am_thu) (field-has-text f_body txt_reply_to_daniel_10am_thu)
   goals met: 1 of 3
6. (click_navigate t_send_button s_reply_compose s_gmail_sent)
   deleted: (at-screen s_reply_compose) (focused f_body)
   added: (at-screen s_gmail_sent)
   goals met: 2 of 3
7. (status complete)
   added: (status-set complete) (finalized)
   goals met: 3 of 3
